In [1]:
import pandas as pd
from sqlalchemy import create_engine

In [2]:
engine = create_engine('postgresql://postgres:sql-test@localhost:5432/c5')

In [3]:
engine.connect()

In [5]:
data = pd.read_csv('yellow_tripdata_2016-03.csv',chunksize=100000)

In [7]:
test_data.head()

,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,pickup_longitude,pickup_latitude,RatecodeID,store_and_fwd_flag,dropoff_longitude,dropoff_latitude,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount
0,1,2016-03-01 00:00:00,2016-03-01 00:07:55,1,2.50,-73.976746,40.765152,1,N,-74.004265,40.746128,1,9.0,0.5,0.5,2.05,0.00,0.3,12.35
1,1,2016-03-01 00:00:00,2016-03-01 00:11:06,1,2.90,-73.983482,40.767925,1,N,-74.005943,40.733166,1,11.0,0.5,0.5,3.05,0.00,0.3,15.35
2,2,2016-03-01 00:00:00,2016-03-01 00:31:06,2,19.98,-73.782021,40.644810,1,N,-73.974541,40.675770,1,54.5,0.5,0.5,8.00,0.00,0.3,63.80
3,2,2016-03-01 00:00:00,2016-03-01 00:00:00,3,10.78,-73.863419,40.769814,1,N,-73.969650,40.757767,1,31.5,0.0,0.5,3.78,5.54,0.3,41.62
4,2,2016-03-01 00:00:00,2016-03-01 00:00:00,5,30.43,-73.971741,40.792183,3,N,-74.177170,40.695053,1,98.0,0.0,0.0,0.00,15.50,0.3,113.80

In [6]:
date_col = ["tpep_pickup_datetime", "tpep_dropoff_datetime"]
data_head = pd.read_csv('yellow_tripdata_2016-03.csv',nrows=0)

In [7]:
data_head

Empty DataFrame
Columns: [VendorID, tpep_pickup_datetime, tpep_dropoff_datetime, passenger_count, trip_distance, pickup_longitude, pickup_latitude, RatecodeID, store_and_fwd_flag, dropoff_longitude, dropoff_latitude, payment_type, fare_amount, extra, mta_tax, tip_amount, tolls_amount, improvement_surcharge, total_amount]
Index: []

In [78]:
#data_head.to_sql(name='nyc_yellow_taxi',con=engine,if_exists='replace')

0

0

In [19]:
from time import time

In [80]:

count = 1
while count <= 20:
    t_start = time()
    df_taxi = next(data)
    df_taxi['tpep_pickup_datetime'] = pd.to_datetime(df_taxi['tpep_pickup_datetime'])
    df_taxi['tpep_dropoff_datetime'] = pd.to_datetime(df_taxi['tpep_dropoff_datetime'])
    df_taxi.to_sql(name='nyc_yellow_taxi',con=engine,if_exists='append',index=False)
    count +=1
    t_end = time()
    
    print(f'{count}) loaded a total of {100000*count} records at {t_end - t_start:.3f} seconds')

1) loaded a total of 100000 records at 20.928 seconds
2) loaded a total of 200000 records at 19.795 seconds
3) loaded a total of 300000 records at 18.356 seconds
4) loaded a total of 400000 records at 21.237 seconds
5) loaded a total of 500000 records at 20.719 seconds
6) loaded a total of 600000 records at 18.496 seconds
7) loaded a total of 700000 records at 18.626 seconds
8) loaded a total of 800000 records at 20.662 seconds
9) loaded a total of 900000 records at 19.759 seconds
10) loaded a total of 1000000 records at 21.208 seconds
11) loaded a total of 1100000 records at 20.928 seconds
12) loaded a total of 1200000 records at 28.379 seconds
13) loaded a total of 1300000 records at 28.536 seconds
14) loaded a total of 1400000 records at 25.554 seconds
15) loaded a total of 1500000 records at 27.655 seconds
16) loaded a total of 1600000 records at 25.344 seconds
17) loaded a total of 1700000 records at 31.257 seconds
18) loaded a total of 1800000 records at 17.868 seconds
19) loaded a total of 1900000 records at 30.545 seconds
20) loaded a total of 2000000 records at 24.635 seconds
21) loaded a total of 2100000 records at 15.803 seconds

In [ ]:
date_col = ["tpep_pickup_datetime", "tpep_dropoff_datetime"]
data_head = pd.read_csv('yellow_tripdata_2016-03.csv',nrows=0)

In [ ]:
data_head.to_sql(name='nyc_yellow_taxi',con=engine,if_exists='replace')

In [ ]:
data = pd.read_csv('yellow_tripdata_2016-03.csv',chunksize=100000)

In [ ]:
count = 1
while count <= 20:
    t_start = time()
    df_taxi = next(data)
    df_taxi['tpep_pickup_datetime'] = pd.to_datetime(df_taxi['tpep_pickup_datetime'])
    df_taxi['tpep_dropoff_datetime'] = pd.to_datetime(df_taxi['tpep_dropoff_datetime'])
    df_taxi.to_sql(name='nyc_yellow_taxi',con=engine,if_exists='append',index=False)
    count +=1
    t_end = time()
    
    print(f'{count}) loaded a total of {100000*count} records at {t_end - t_start:.3f} seconds')

# AN IMPROVED CODE

In [8]:
df_data_head = pd.read_csv('yellow_tripdata_2016-03.csv',nrows=0)
df_data_head.to_sql(name='another_nyc_yellow_taxi',con=engine,if_exists='replace')

0

In [14]:
from time import time
import pandas as pd
def etl_nyc_taxi(chunk_size, connection):
    
    df_data = pd.read_csv('yellow_tripdata_2016-03.csv',chunksize=chunk_size)
    count = 0
    overall_start_time = time()
    for chunk in df_data:
        if count < 2:
            t_start = time()
            chunk['tpep_pickup_datetime'] = pd.to_datetime(chunk['tpep_pickup_datetime'])
            chunk['tpep_dropoff_datetime'] = pd.to_datetime(chunk['tpep_dropoff_datetime'])
            chunk.to_sql(name='another_nyc_yellow_taxi',con=connection,if_exists='append')
            count +=1
            t_end = time()
            print(f'{count}) loaded next chunk {t_end - t_start:.3f} seconds')

    overall_end_time = time() - overall_start_time
    print(f'finished loading a total of {chunk_size*count:,} records in {overall_end_time} seconds')

In [16]:
#etl_nyc_taxi(50,engine)

# SQL ETL

In [17]:
import pandas as pd
from sqlalchemy import create_engine

In [18]:
engine = create_engine('postgresql://postgres:sql-test@localhost:5432/c5')
engine.connect()

In [21]:
data_overview = '''
SELECT * FROM nyc_yellow_taxi LIMIT 4

'''
pd.read_sql(data_overview,engine)

,index,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,pickup_longitude,pickup_latitude,RatecodeID,store_and_fwd_flag,dropoff_longitude,dropoff_latitude,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount
0,None,1,2016-03-03 15:01:43,2016-03-03 15:04:19,1,0.4,-73.9661865234375,40.77042770385742,1,N,-73.96371459960938,40.77533721923828,2,3.5,0.0,0.5,0.0,0.0,0.3,4.3
1,None,2,2016-03-03 15:01:43,2016-03-03 15:08:27,1,0.41,-73.95187377929686,40.777950286865234,1,N,-73.95322418212889,40.7734489440918,2,5.5,0.0,0.5,0.0,0.0,0.3,6.3
2,None,1,2016-03-03 15:01:44,2016-03-03 15:13:01,1,1.0,-73.98198699951173,40.75774383544922,1,N,-73.98223114013672,40.76799392700195,1,8.5,0.0,0.5,1.85,0.0,0.3,11.15
3,None,1,2016-03-03 15:01:44,2016-03-03 15:06:10,1,0.9,-73.96372985839844,40.75689315795898,1,N,-73.9732894897461,40.74777603149414,2,5.0,0.0,0.5,0.0,0.0,0.3,5.8

In [33]:
#Which day had the largest tip of the month?
largest_tip_of_month_1 = '''


SELECT DATE(tpep_dropoff_datetime) AS largest_tip_day , SUM(CAST(tip_amount AS NUMERIC)) AS total_tip 
from nyc_yellow_taxi GROUP BY tpep_dropoff_datetime
ORDER BY total_tip DESC LIMIT 1
'''

pd.read_sql(largest_tip_of_month_1,engine)

  largest_tip_day  total_tip
0      2016-03-03     851.36

In [35]:
#Which day had the largest tip of the month?
largest_tip_of_month = '''

SELECT largest_tip_day FROM

(SELECT DATE(tpep_dropoff_datetime) AS largest_tip_day , SUM(CAST(tip_amount AS NUMERIC)) AS total_tip 
from nyc_yellow_taxi GROUP BY tpep_dropoff_datetime
ORDER BY total_tip DESC LIMIT 1) AS largest_tip_of_month
'''

pd.read_sql(largest_tip_of_month,engine)

  largest_tip_day
0      2016-03-03

In [42]:
#How many taxi trips were there in the month?

total_taxi_trips = '''
SELECT COUNT(trip_distance) AS tt_taxi_trips from nyc_yellow_taxi
WHERE CAST(trip_distance AS NUMERIC) > 0
'''

pd.read_sql(total_taxi_trips,engine)

   tt_taxi_trips
0        2088767

**What’s the most popular destination?**
- concatenate the long & lat (in a new col: location_map)
- Group location_map & count
- The highest count would be the most popular

In [62]:
#What’s the most popular destination?

popular_destination = '''

SELECT popular_destination FROM

(SELECT

CASE
    WHEN dropoff_longitude IS NOT NULL THEN 
    CONCAT('[',dropoff_longitude,', ',dropoff_latitude,']')
    
END AS popular_destination,

COUNT(*) AS total_trips

FROM nyc_yellow_taxi

GROUP BY popular_destination
ORDER BY total_trips DESC
LIMIT 1) AS popular_destination


'''

pd.read_sql(popular_destination,engine)

  location_map
0   [0.0, 0.0]

# CREATING REPORTING TABLES

In [ ]:
#largest_tip_of_month|total_taxi_trips|popular_destination

In [73]:
report = '''
SELECT CURRENT_DATE AS ingestion_date, * FROM

(SELECT largest_tip_day FROM

(SELECT DATE(tpep_dropoff_datetime) AS largest_tip_day , SUM(CAST(tip_amount AS NUMERIC)) AS total_tip 
from nyc_yellow_taxi GROUP BY tpep_dropoff_datetime
ORDER BY total_tip DESC LIMIT 1) AS largest_tip_of_month) AS a,

(SELECT COUNT(trip_distance) AS tt_taxi_trips from nyc_yellow_taxi
WHERE CAST(trip_distance AS NUMERIC) > 0) AS b,

(SELECT popular_destination FROM

(SELECT

CASE
    WHEN dropoff_longitude IS NOT NULL THEN 
    CONCAT('[',dropoff_longitude,', ',dropoff_latitude,']')
    
END AS popular_destination,

COUNT(*) AS total_trips

FROM nyc_yellow_taxi

GROUP BY popular_destination
ORDER BY total_trips DESC
LIMIT 1) AS popular_destination) AS c


'''

#pd.read_sql(report,engine)

In [74]:
df_report = pd.read_sql(report,engine)

In [75]:
df_report.to_sql('nyc_reporting_table', con=engine,if_exists='append')

1

# CLEANING UP WITH REUSABLE FUNCTION

In [76]:
report = '''
SELECT CURRENT_DATE AS ingestion_date, * FROM

(SELECT largest_tip_day FROM

(SELECT DATE(tpep_dropoff_datetime) AS largest_tip_day , SUM(CAST(tip_amount AS NUMERIC)) AS total_tip 
from nyc_yellow_taxi GROUP BY tpep_dropoff_datetime
ORDER BY total_tip DESC LIMIT 1) AS largest_tip_of_month) AS a,

(SELECT COUNT(trip_distance) AS tt_taxi_trips from nyc_yellow_taxi
WHERE CAST(trip_distance AS NUMERIC) > 0) AS b,

(SELECT popular_destination FROM

(SELECT

CASE
    WHEN dropoff_longitude IS NOT NULL THEN 
    CONCAT('[',dropoff_longitude,', ',dropoff_latitude,']')
    
END AS popular_destination,

COUNT(*) AS total_trips

FROM nyc_yellow_taxi

GROUP BY popular_destination
ORDER BY total_trips DESC
LIMIT 1) AS popular_destination) AS c


'''

In [83]:
def transform_data(query,connection):
    try:
        report_query = pd.read_sql(query,connection)
        print('successfully transformed the data')
        return report_query      
    except:
        print('Encountered error while transforming')

In [81]:
def load_report_to_warehouse(dataframe,table,connection):
    try:
        dataframe.to_sql(table, con=connection,if_exists='append')
        print(f'successfully updated {table} table')
    except:
        print(f'Could not update {table}')

In [84]:
#RUNNING THE ENTIRE PROCESSES
df_report = transform_data(report,engine)
load_report_to_warehouse(df_report,'nyc_reports',engine)

successfully transformed the data
successfully updated nyc_reports table